## Pandas Day- 13

## Join() function  
- **`join()`** in Pandas is used to combine two DataFrames based on their **index**.

In [1]:
import pandas as pd

### Creating Sample DataFrames

In [3]:
df1 = pd.DataFrame({
    "Name": ["Amit", "Rahul", "Neha"],
    "Age": [21, 22, 20]
}, index=[0, 1, 2])

In [4]:
df1

    Name  Age
0   Amit   21
1  Rahul   22
2   Neha   20

In [4]:
df2

   C   D
0  4  40
1  5  50
2  6  60

In [5]:
df2 = pd.DataFrame({
    "Marks": [85, 78, 90]
}, index=[0, 1, 2])

df2

   Marks
0     85
1     78
2     90

### Basic join() (Index-based)

In [6]:
df1.join(df2)

    Name  Age  Marks
0   Amit   21     85
1  Rahul   22     78
2   Neha   20     90

In [7]:
df2.join(df1)

   Marks   Name  Age
0     85   Amit   21
1     78  Rahul   22
2     90   Neha   20

### Right Join

In [15]:
df1.join(df2,how='right')

   A   B  C   D
0  1  10  4  40
1  2  20  5  50

### Left Join

In [16]:
df1.join(df2,how='left')

   A   B    C     D
0  1  10  4.0  40.0
1  2  20  5.0  50.0
2  3  30  NaN   NaN

### Inner Join

In [17]:
df1.join(df2,how='inner')

   A   B  C   D
0  1  10  4  40
1  2  20  5  50

### Outer Join

In [18]:
df1.join(df2,how='outer')

   A   B    C     D
0  1  10  4.0  40.0
1  2  20  5.0  50.0
2  3  30  NaN   NaN

In [19]:
df1 = pd.DataFrame({'A': [1,2,3],
 'B': [10,20,30]})
df2 = pd.DataFrame({'C': [4,5,6],
 'D': [40,50,60]})

In [25]:
df1.join(df2,lsuffix ='_1')

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

In [26]:
df1.join(df2,lsuffix ='_2')

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60